test/all/sample-jetton.expected.callgraph.dot
digraph "CallGraph" {
    node [shape=box];
    node_6 [label="inline fun emptySlice(): Slice" style=filled fillcolor="#F0F8FF"];
    node_13 [label="inline fun contractAddress(s: StateInit): Address" style=filled fillcolor="#F0F8FF"];
    node_15 [label="fun send(params: SendParameters): Int" style=filled fillcolor="#F0F8FF"];
    node_20 [label="fun Ownable::requireOwner()"];
    node_21 [label="get fun Ownable::owner(): Address"];
    node_22 [label="OwnableTransferable::receive(msg: ChangeOwner)"];
    node_23 [label="SampleJetton::init(owner: Address, content: Cell, max_supply: Int)
[StateWrite<totalSupply,max_supply,owner,mintable,content>]"];
    node_24 [label="SampleJetton::receive(msg: Mint)
[StateRead<owner,mintable>]"];
    node_25 [label="SampleJetton::receive('Mint: 100')
[StateRead<mintable,owner>]"];
    node_26 [label="SampleJetton::receive('Owner: MintClose')
[StateRead<owner>,StateWrite<mintable>]"];
    node_27 [label="Jetton::receive(msg: TokenUpdateContent)
[StateWrite<content>]"];
    node_28 [label="Jetton::receive(msg: TokenBurnNotification)
[Send,StateWrite<totalSupply>]"];
    node_29 [label="fun Jetton::mint(to: Address, amount: Int, response_destination: Address)
[Send,StateRead<totalSupply,max_supply>,StateWrite<totalSupply>]"];
    node_30 [label="fun Jetton::requireWallet(owner: Address)"];
    node_31 [label="virtual fun Jetton::getJettonWalletInit(address: Address): StateInit"];
    node_32 [label="get fun Jetton::get_jetton_data(): JettonData
[StateRead<totalSupply,mintable,owner,content>]"];
    node_33 [label="get fun Jetton::get_wallet_address(owner: Address): Address"];
    node_34 [label="JettonDefaultWallet::init(master: Address, owner: Address)
[StateWrite<balance,owner,master>]"];
    node_35 [label="JettonDefaultWallet::receive(msg: TokenTransfer)
[Send,StateRead<owner,gasConsumption,minTonsForStorage,balance,master>,StateWrite<balance>]"];
    node_36 [label="JettonDefaultWallet::receive(msg: TokenTransferInternal)
[Send,StateRead<master,balance,owner>,StateWrite<balance>]"];
    node_37 [label="get fun JettonDefaultWallet::msgValue(value: Int): Int
[StateRead<minTonsForStorage>]"];
    node_38 [label="JettonDefaultWallet::receive(msg: TokenBurn)
[Send,StateRead<owner,balance,gasConsumption,minTonsForStorage,master>,StateWrite<balance>]"];
    node_39 [label="JettonDefaultWallet::bounced(msg: Slice)
[StateWrite<balance>]"];
    node_40 [label="get fun JettonDefaultWallet::get_wallet_data(): JettonWalletData
[StateRead<balance,owner,master>]"];
    node_41 [label="context"];
    node_42 [label="require"];
    node_43 [label="SampleJetton::mint"];
    node_44 [label="Jetton::requireOwner"];
    node_45 [label="myAddress"];
    node_46 [label="ctx::readForwardFee"];
    node_47 [label="min"];
    node_48 [label="ton"];
    node_49 [label="myBalance"];
    node_50 [label="msg::loadUint"];
    node_51 [label="msg::loadCoins"];
    node_24 -> node_41;
    node_24 -> node_42;
    node_24 -> node_42;
    node_24 -> node_43;
    node_25 -> node_41;
    node_25 -> node_42;
    node_25 -> node_43;
    node_26 -> node_41;
    node_26 -> node_42;
    node_27 -> node_44;
    node_28 -> node_30;
    node_28 -> node_15;
    node_29 -> node_42;
    node_29 -> node_31;
    node_29 -> node_15;
    node_29 -> node_13;
    node_29 -> node_45;
    node_29 -> node_6;
    node_30 -> node_41;
    node_30 -> node_31;
    node_30 -> node_42;
    node_30 -> node_13;
    node_31 -> node_45;
    node_32 -> node_31;
    node_32 -> node_45;
    node_33 -> node_31;
    node_33 -> node_13;
    node_35 -> node_41;
    node_35 -> node_42;
    node_35 -> node_46;
    node_35 -> node_46;
    node_35 -> node_42;
    node_35 -> node_47;
    node_35 -> node_48;
    node_35 -> node_42;
    node_35 -> node_13;
    node_35 -> node_15;
    node_36 -> node_41;
    node_36 -> node_42;
    node_36 -> node_13;
    node_36 -> node_42;
    node_36 -> node_15;
    node_36 -> node_37;
    node_36 -> node_46;
    node_36 -> node_15;
    node_37 -> node_49;
    node_37 -> node_47;
    node_38 -> node_41;
    node_38 -> node_42;
    node_38 -> node_42;
    node_38 -> node_46;
    node_38 -> node_42;
    node_38 -> node_15;
    node_39 -> node_50;
    node_39 -> node_50;
    node_39 -> node_51;
    node_39 -> node_42;
}
