test/all/sample-jetton.expected.callgraph.mmd
graph TD
    node_6["inline fun emptySlice(): Slice"]
    node_13["inline fun contractAddress(s: StateInit): Address"]
    node_15["fun send(params: SendParameters): Int"]
    node_20["fun Ownable::requireOwner()"]
    node_21["Ownable::get fun owner(): Address"]
    node_22["OwnableTransferable::receive(msg: ChangeOwner)"]
    node_23["SampleJetton::init(owner: Address, content: Cell, max_supply: Int)
[StateWrite<totalSupply,max_supply,owner,mintable,content>]"]
    node_24["SampleJetton::receive(msg: Mint)
[StateRead<owner,mintable>]"]
    node_25["SampleJetton::receive('Mint: 100')
[StateRead<mintable,owner>]"]
    node_26["SampleJetton::receive('Owner: MintClose')
[StateRead<owner>,StateWrite<mintable>]"]
    node_27["Jetton::receive(msg: TokenUpdateContent)
[StateWrite<content>]"]
    node_28["Jetton::receive(msg: TokenBurnNotification)
[Send,StateWrite<totalSupply>]"]
    node_29["fun Jetton::mint(to: Address, amount: Int, response_destination: Address)
[Send,StateRead<totalSupply,max_supply>,StateWrite<totalSupply>]"]
    node_30["fun Jetton::requireWallet(owner: Address)"]
    node_31["Jetton::virtual fun getJettonWalletInit(address: Address): StateInit"]
    node_32["Jetton::get fun get_jetton_data(): JettonData
[StateRead<totalSupply,mintable,owner,content>]"]
    node_33["Jetton::get fun get_wallet_address(owner: Address): Address"]
    node_34["JettonDefaultWallet::init(master: Address, owner: Address)
[StateWrite<balance,owner,master>]"]
    node_35["JettonDefaultWallet::receive(msg: TokenTransfer)
[Send,StateRead<owner,gasConsumption,minTonsForStorage,balance,master>,StateWrite<balance>]"]
    node_36["JettonDefaultWallet::receive(msg: TokenTransferInternal)
[Send,StateRead<master,balance,owner>,StateWrite<balance>]"]
    node_37["JettonDefaultWallet::get fun msgValue(value: Int): Int
[StateRead<minTonsForStorage>]"]
    node_38["JettonDefaultWallet::receive(msg: TokenBurn)
[Send,StateRead<owner,balance,gasConsumption,minTonsForStorage,master>,StateWrite<balance>]"]
    node_39["JettonDefaultWallet::bounced(msg: Slice)
[StateWrite<balance>]"]
    node_40["JettonDefaultWallet::get fun get_wallet_data(): JettonWalletData
[StateRead<balance,owner,master>]"]
    node_41["context"]
    node_42["require"]
    node_43["SampleJetton::mint"]
    node_44["Jetton::requireOwner"]
    node_45["myAddress"]
    node_46["ctx::readForwardFee"]
    node_47["min"]
    node_48["ton"]
    node_49["myBalance"]
    node_50["msg::loadUint"]
    node_51["msg::loadCoins"]
    node_24 --> node_41
    node_24 --> node_42
    node_24 --> node_42
    node_24 --> node_43
    node_25 --> node_41
    node_25 --> node_42
    node_25 --> node_43
    node_26 --> node_41
    node_26 --> node_42
    node_27 --> node_44
    node_28 --> node_30
    node_28 --> node_15
    node_29 --> node_42
    node_29 --> node_31
    node_29 --> node_15
    node_29 --> node_13
    node_29 --> node_45
    node_29 --> node_6
    node_30 --> node_41
    node_30 --> node_31
    node_30 --> node_42
    node_30 --> node_13
    node_31 --> node_45
    node_32 --> node_31
    node_32 --> node_45
    node_33 --> node_31
    node_33 --> node_13
    node_35 --> node_41
    node_35 --> node_42
    node_35 --> node_46
    node_35 --> node_46
    node_35 --> node_42
    node_35 --> node_47
    node_35 --> node_48
    node_35 --> node_42
    node_35 --> node_13
    node_35 --> node_15
    node_36 --> node_41
    node_36 --> node_42
    node_36 --> node_13
    node_36 --> node_42
    node_36 --> node_15
    node_36 --> node_37
    node_36 --> node_46
    node_36 --> node_15
    node_37 --> node_49
    node_37 --> node_47
    node_38 --> node_41
    node_38 --> node_42
    node_38 --> node_42
    node_38 --> node_46
    node_38 --> node_42
    node_38 --> node_15
    node_39 --> node_50
    node_39 --> node_50
    node_39 --> node_51
    node_39 --> node_42
    style node_6 fill:#F0F8FF,stroke:#000,stroke-width:1px;
    style node_13 fill:#F0F8FF,stroke:#000,stroke-width:1px;
    style node_15 fill:#F0F8FF,stroke:#000,stroke-width:1px;
